{
    "@context": "http://schema.org/",
    "@graph": [
      {
        "@id": "http://example.org/parks-core",
        "@type": "Organization",
        "name": "Parks Core",
        "description": "Categorization of amusement parks based on their core activities: Attractions, Exhibitions, Shows, Wildlife.",
        "hasBranch": [
          {
            "@id": "http://example.org/attractions",
            "name": "Attractions",
            "description": "Parks filled with mechanical rides, roller coasters, water slides, and themed areas designed for entertainment and thrill.",
            "example": {
              "@type": "Place",
              "name": "Thrill Kingdom",
              "description": "Featuring some of the world's most extreme roller coasters, family-friendly rides, and immersive themed lands."
            }
          },
          {
            "@id": "http://example.org/exhibitions",
            "name": "Exhibitions",
            "description": "Parks specializing in exhibitions, such as interactive science centers, art galleries, and historical museums.",
            "example": {
              "@type": "Place",
              "name": "Discovery Dome",
              "description": "Features hands-on science exhibits, planetarium shows, and art installations that encourage curiosity and learning."
            }
          },
          {
            "@id": "http://example.org/shows",
            "name": "Shows",
            "description": "Parks primarily offering live shows, including musical performances, theater productions, and educational demonstrations.",
            "example": {
              "@type": "Place",
              "name": "Spectacle Island",
              "description": "Home to award-winning theatrical performances, live music shows, and cultural festivals that entertain and educate."
            }
          },
          {
            "@id": "http://example.org/wildlife",
            "name": "Wildlife",
            "description": "Parks that focus on providing experiences with animals and nature, often including zoos, safari parks, and marine life parks.",
            "example": {
              "@type": "Place",
              "name": "Global Wildlife Center",
              "description": "A vast reserve where visitors can interact with and observe animals in settings that mimic their natural habitats, promoting conservation and education."
            }
          }
        ]
      }
    ]
  }
  